<p><a href="index.html"><img src="logo.png" alt="Logo" title="" /></a></p>

<h1>Exemples de simulations int&eacute;r&eacute;ssantes</h1>

<h2>Equilibre proies-pr&eacute;dateurs avec deux exp&egrave;ces</h2>

<p>Quand on laisse une population d'&ecirc;tres-verts &eacute;voluer sans pr&eacute;dateurs, avec juste de l'eau, on a d&eacute;j&agrave; un mod&egrave;le proies-pr&eacute;dateurs similaire au mod&egrave;le de
<a href="fr.wikipedia.org/wiki/Equations_de_Lotka-Volterra">Lotka-Volterra</a> &agrave; ceci pr&egrave;s que la composante positive de la d&eacute;riv&eacute;e quantit&eacute; d'eau est constante.</p>

<p>L'&eacute;quation d'&eacute;volution d'un syst&egrave;me avec des &ecirc;tres-verts qui se reproduisent et de l'eau s'&eacute;crit : </p>

<pre><code>dw/dt=alpha-beta*g

dg/dt=-g*(deta-gamma*w)
</code></pre>

<p>O&ugrave; : </p>

<ul>
<li>w est la quantit&eacute; d'eau disponible</li>
<li>g est le nombre d'&ecirc;tres-verts</li>
<li>alpha est le facteur de pluie</li>
<li>beta est la vitesse &agrave; laquelle les flaques d'eau disparaissent au contact des &ecirc;tres-verts</li>
<li>gamma est le facteur de reproduction des &ecirc;tres-verts</li>
<li>delta est la vitesse &agrave; laquelle les &ecirc;tres-verts meurent en l'absence d'eau</li>
</ul>

<p>En r&eacute;alit&eacute; l'&eacute;quation est un peu plus complexe car la vitesse de reproduction ne d&eacute;pend pas directement de la quantit&eacute; d'eau, mais d&eacute;pend par contre du nombre d'&ecirc;tres-verts
au carr&eacute;.</p>

<p>Cependant, en laissant ce mod&egrave;le &eacute;voluer, on obtient des oscillations semblables &agrave; celles du mod&egrave;le Lotka-Volterra :</p>

<p><img src="graph1.png" alt="Graphique" title="" /></p>

<h2>Equilibre proies-pr&eacute;dateurs avec trois esp&egrave;ces</h2>

<p>Avec trois esp&egrave;ces, il est difficile voire impossible d'obtenir un &eacute;quilibre. Voici les courbes de l'&eacute;volution du nombre d'&ecirc;tres-verts et d'&ecirc;tres-rouges au cours du temps
durant une simulation avec des &ecirc;tres-verts, des &ecirc;tres-rouges et de l'eau (quantit&eacute; d'eau non repr&eacute;sent&eacute;e) :</p>

<p><img src="graph2.png" alt="Graphique" title="" /></p>
